// 1.Простая: «Касса»
// Пользователь вводит количество товаров n, затем n цен. Цены хранятся в IntArray.
// Выведи чек, где каждая строка выглядит так: 1. 120 ₽. Нумерация с 1, а индексы в массиве с 0.
// Выведи итого и самую дорогую позицию с её номером в чеке.
// Условие: var только там, где значение реально меняется (сумма, максимум). Всё остальное val.

fun main() {
    print("Введи n: ")
    val n = readlnOrNull()?.toIntOrNull() ?: 0
    val prices = IntArray(n)
    for (i in 0 until n) {
        print("Введи цену на ${i+1} продукт: ")
        prices[i] = readlnOrNull()?.toIntOrNull() ?: 0
    }
    for(i in 0 until n){
        println("${i+1}: ${prices[i]}")
    }
}